v2206/solver_ADMFoam/multi_bubbleComparison/ADMultiFoam/system/test/Xsu

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Xsu;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField	uniform 0.3122;

boundaryField
{
    allBoundary
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    GeoTank
    {
        type            zeroGradient;
    }

    GeoShaft
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
